# Файлы
WORD_FILE_MAIN = "Новые данные.docx"
WORD_FILE_LIST = "Новый список 1.docx"

# Списки администраторов
ADMIN_LIST = {
    'ДАХНОВ': '628169420', 'НАЛЕТОВ': '524778610', 'ТЕТКИН': '903566230', 'МУСТЕЦОВ': '578534592',
    'СОЛОВЬЕВ': '1067704964', 'ПАВЛОВ': '5090882297', 'МОХОВ': '7560956034', 'САВЕЛЬЕВ': '853162163',
    'ИСАЕВ': '723413389', 'ГОРБАЧЕВ': '928386452', 'КОМКОВ': '2143217131', 'ГОЛОВАЧ': '5786098254',
    'ШИРКОВ': '972996071', 'ХОМЕНКО': '794780957'
}

# Списки главных администраторов
MAIN_ADMIN_LIST = {
    'ДАХНОВ': '628169420', 'НАЛЕТОВ': '524778610', 'ТЕТКИН': '903566230', 'МУСТЕЦОВ': '578534592',
    'СОЛОВЬЕВ': '1067704964', 'ПАВЛОВ': '5090882297', 'МОХОВ': '7560956034', 'САВЕЛЬЕВ': '853162163',
    'КОМКОВ': '2143217131'
}

# Специальный пользователь
SPECIAL_USER_ID = '853162163'

# Номер чата для обработки
TARGET_TOPIC_ID = 2

# Время увольнения по умолчанию
DEFAULT_DISMISSAL_TIME = '18:30-20:40'

# Словарь офицеров
OFFICER_DICT = {
    'дутка-дтк-ст лт-стлт': ('Курсовой офицер-преподаватель 6 факультета', 'старший лейтенант', 'А.Дутка'),
    'саха-сахаутдинов-лт-лейтенант-футболист': ('Курсовой офицер-преподаватель 6 факультета', 'лейтенант', 'Р.Сахаутдинов'),
    'илюшкин-кэп-кеп-капитан': ('Курсовой офицер-преподаватель 6 факультета', 'капитан', 'С.Илюшкин'),
    'майор-нк-колесницкий-колесо-начальник курса': ('Начальник курса 6 факультета', 'майор', 'А.Колесницкий')
}

# Ключевые слова для форм одежды
FORM_KEYWORDS = {"спорт", "офиска", "гражданка"}

# Ключевые слова для команд
COMMAND_KEYWORDS = {"спорт", "офиска", "гражданка", "список", "офицер", "документ", "очистить", "лист"}

# Однофамильцы (требуют дополнительной проверки инициалов)
NAMESAKES = {'кузнецов', 'якунин'}

# Telegram Bot Token
BOT_TOKEN = "example:bot_token"